IMSAssociation/IMSAssociationCreatePSI.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" xmlns:hss="http://schemas.ericsson.com/ma/HSS/">
   <soapenv:Header>
      <cai3:SessionId>${SessionId}</cai3:SessionId>
   </soapenv:Header>
   <soapenv:Body>
      <cai3:Create>
         <cai3:MOType>IMSAssociation@http://schemas.ericsson.com/ma/HSS/</cai3:MOType>
         <cai3:MOId>
            <hss:associationId>${subscriberId}</hss:associationId>
         </cai3:MOId>
         <cai3:MOAttributes>
            <hss:CreateIMSAssociation associationId="${subscriberId}">
               <hss:associationId>${subscriberId}</hss:associationId>
               <hss:chargingProfId>DefaultChargingProfile</hss:chargingProfId>
               <hss:isPsi>true</hss:isPsi>
               <hss:privateUser privateUserId="${privateUserId}">
                  <hss:privateUserId>${privateUserId}</hss:privateUserId>
               </hss:privateUser>               
               <hss:subscriberServiceProfile serviceProfileId="${serviceProfileId}">
                  <hss:serviceProfileId>${serviceProfileId}</hss:serviceProfileId>
                  <hss:configuredServiceProfile configuredServiceProfileId="${configuredServiceProfileId}">
                     <hss:configuredServiceProfileId>${configuredServiceProfileId}</hss:configuredServiceProfileId>
                  </hss:configuredServiceProfile>
                  <hss:maxNumberSessions>99</hss:maxNumberSessions> 
               </hss:subscriberServiceProfile>
            </hss:CreateIMSAssociation>
         </cai3:MOAttributes>
      </cai3:Create>
   </soapenv:Body>
</soapenv:Envelope>
